code-review/NRB_3471_3546/База_Стало/Documents/УчастиеВКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УчастиеВКД</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КарточкаКД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЦБ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий250</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОпцииКДВыкуп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтветыНаВопросыКГолосованию</Name>
					<Comment>(КД Собрание)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерВопроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>За</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Против</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Воздержался</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/УчастиеВКД/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение") Тогда
		Если Основание.ВидОперацииД = Справочники.ВидыОпераций.УчастиеВКД Тогда
			ДокументОснование	= Основание.Ссылка;			
			Дата				= ОбщегоНазначения.ДатаДокумента(Основание);
			ЦеннаяБумага		= Основание.ЦБ;
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание, "КарточкаКД, ВидКД, Инициатор, НомерОпцииКДВыкуп, КоличествоЦБ, Депонент, СчетДепо");
			ОтветыНаВопросыКГолосованию.Очистить();
			Для каждого СтрокаТЧ из Основание.ОтветыНаВопросыКГолосованию Цикл
				НоваяСтрока = ОтветыНаВопросыКГолосованию.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			КонецЦикла;
		Иначе	                      
			СтандартнаяОбработка = Ложь;
			Сообщить("На основании данного вида поручения нельзя создать документ Участие в КД!!!");
			Возврат;
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПоСобытию(ЭтотОбъект, "Запись");
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
	Если Не ЭтоНовый() Тогда
		Изменил	= ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Автор	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка	= Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры
